CREATE DATABASE  IF NOT EXISTS `weatherdb` /*!40100 DEFAULT CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci */ /*!80016 DEFAULT ENCRYPTION='N' */;
USE `weatherdb`;
-- MySQL dump 10.13  Distrib 8.0.42, for Win64 (x86_64)
--
-- Host: 127.0.0.1    Database: weatherdb
-- ------------------------------------------------------
-- Server version	8.0.42

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `authodata`
--

DROP TABLE IF EXISTS `authodata`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `authodata` (
  `login` varchar(45) NOT NULL,
  `password` varchar(45) NOT NULL,
  `admin` tinyint NOT NULL DEFAULT '0',
  `savedCountry` varchar(45) DEFAULT NULL,
  `savedCity` varchar(100) DEFAULT NULL,
  PRIMARY KEY (`login`),
  UNIQUE KEY `login_UNIQUE` (`login`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `authodata`
--

LOCK TABLES `authodata` WRITE;
/*!40000 ALTER TABLE `authodata` DISABLE KEYS */;
INSERT INTO `authodata` VALUES ('annchernyavskaya55@gmail.com','ann123!',1,NULL,NULL),('anuta23@gmail.com','anuta1&',0,'Україна','Київ'),('borombom@gmail.cm','Bor123&',0,NULL,NULL),('borombom@gmail.com','Bor123&',0,'Україна','Київ'),('lalala@gmail.com','Abc11#',0,'Україна','Київ'),('sonya.brnv@gmail.com','s%onya123',1,'Україна','Київ');
/*!40000 ALTER TABLE `authodata` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `weatherdata`
--

DROP TABLE IF EXISTS `weatherdata`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `weatherdata` (
  `id` int NOT NULL AUTO_INCREMENT,
  `country` varchar(45) NOT NULL,
  `city` varchar(100) NOT NULL,
  `date` date NOT NULL,
  `temperature` float NOT NULL,
  `precipitation` varchar(10) NOT NULL,
  `precipitationVal` tinyint unsigned NOT NULL,
  `humidity` tinyint unsigned NOT NULL,
  `pressure` smallint unsigned NOT NULL,
  `wind` varchar(20) NOT NULL,
  `windSpeed` smallint unsigned NOT NULL,
  UNIQUE KEY `id_UNIQUE` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=104 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `weatherdata`
--

LOCK TABLES `weatherdata` WRITE;
/*!40000 ALTER TABLE `weatherdata` DISABLE KEYS */;
INSERT INTO `weatherdata` VALUES (1,'Україна','Київ','2025-04-25',15.5,'дощ',10,80,1012,'Пн',18),(2,'Україна','Київ','2025-05-01',18.2,'ясно',12,60,1010,'ПнСх',21),(3,'Україна','Київ','2025-05-02',18,'ясно',11,62,1010,'ПнСх',20),(4,'Україна','Київ','2025-05-03',19.5,'хмарно',9,59,1008,'Зх',22),(5,'Україна','Київ','2025-05-04',19.8,'ясно',15,60,1011,'Зх',21),(6,'Україна','Київ','2025-05-05',20.1,'дощ',14,67,1005,'Пд',24),(7,'Україна','Київ','2025-05-06',21,'дощ',70,60,1015,'Пд',25),(8,'Україна','Київ','2025-05-07',21.3,'ясно',11,55,1011,'Пн',26),(9,'Україна','Київ','2025-05-08',20.1,'дощ',50,67,1005,'Сх',24),(10,'Україна','Київ','2025-05-09',22,'хмарно',10,52,1010,'Сх',27),(11,'Україна','Київ','2025-05-10',22,'дощ',40,67,1005,'Пд',24),(12,'Україна','Київ','2025-05-11',23.4,'дощ',50,65,1003,'ПдЗх',28),(13,'Україна','Київ','2025-05-12',20.1,'дощ',14,67,1005,'Пд',24),(15,'Україна','Київ','2025-05-14',20.1,'хмарно',14,67,1005,'Сх',24),(16,'Україна','Київ','2025-05-15',25,'ясно',8,48,1012,'Пн',30),(17,'Україна','Київ','2025-05-16',25,'ясно',8,50,1012,'Пн',25),(18,'Україна','Київ','2025-05-17',24.6,'хмарно',7,50,1014,'ПнСх',28),(19,'Україна','Київ','2025-05-18',25,'хмарно',8,50,1012,'Пн',30),(20,'Україна','Київ','2025-05-19',23.8,'дощ',13,63,1006,'Зх',27),(21,'Україна','Київ','2025-05-20',23.8,'дощ',70,63,1006,'Зх',29),(22,'Україна','Київ','2025-05-21',22.9,'ясно',6,44,1013,'Сх',26),(23,'Україна','Київ','2025-05-22',23.8,'дощ',13,63,1006,'Зх',27),(24,'Україна','Київ','2025-05-23',21.5,'хмарно',10,51,1011,'ПдСх',25),(25,'Україна','Київ','2025-05-24',23.8,'дощ',80,50,1006,'Зх',27),(26,'Україна','Київ','2025-05-25',20.7,'дощ',12,68,1004,'ПдЗх',24),(27,'Україна','Київ','2025-04-25',15.5,'дощ',10,80,1012,'Пн',18),(28,'Україна','Львів','2025-04-25',19.5,'ясно',35,46,1012,'Сх',20),(29,'Україна','Одеса','2025-04-25',18.1,'дощ',33,43,1016,'Зх',11),(30,'Україна','Харків','2025-04-25',11.2,'ясно',35,74,1016,'ПдСх',9),(31,'Україна','Запоріжжя','2025-04-25',16.4,'ясно',22,55,1013,'Пд',12),(32,'Україна','Черкаси','2025-04-25',14.2,'дощ',5,67,1010,'Сх',15),(33,'Україна','Дніпро','2025-04-25',17,'сніг',1,80,1012,'ПдЗх',10),(34,'Україна','Кривий Ріг','2025-04-25',13.8,'хмарно',0,75,1014,'ПдЗх',8),(35,'Україна','Миколаїв','2025-04-25',19,'ясно',12,48,1015,'ПдЗх',14),(36,'Україна','Чернівці','2025-04-25',17.5,'дощ',8,70,1011,'ПдСх',11),(37,'Україна','Львів','2025-04-26',19.5,'ясно',35,46,1012,'Сх',20),(38,'Україна','Одеса','2025-04-26',18.1,'дощ',33,43,1016,'Зх',11),(39,'Україна','Харків','2025-04-26',11.2,'ясно',35,74,1016,'ПдСх',9),(40,'Україна','Запоріжжя','2025-04-26',16.4,'ясно',22,55,1013,'Пд',12),(41,'Україна','Черкаси','2025-04-26',14.2,'дощ',5,67,1010,'Сх',15),(42,'Україна','Кривий Ріг','2025-04-26',13.8,'хмарно',0,75,1014,'ПдЗх',8),(43,'Україна','Миколаїв','2025-04-26',19,'ясно',12,48,1015,'ПдЗх',14),(44,'Україна','Львів','2025-04-27',19.5,'ясно',35,46,1012,'Сх',20),(45,'Україна','Одеса','2025-04-27',18.1,'дощ',33,43,1016,'Зх',11),(46,'Польща','Варшава','2025-04-25',12.3,'хмарно',0,76,1011,'ПнСх',13),(47,'Польща','Краків','2025-04-25',24.4,'ясно',86,50,1010,'Сх',16),(48,'Польща','Гданськ','2025-04-25',22.2,'сніг',2,33,1017,'ПдСх',11),(49,'Польща','Вроцлав','2025-04-25',9.1,'дощ',73,59,1010,'Пн',9),(50,'Польща','Варшава','2025-04-26',12,'хмарно',3,75,1012,'Пн',14),(51,'Німеччина','Берлін','2025-04-25',14.7,'ясно',0,68,1015,'Сх',9),(52,'Німеччина','Мюнхен','2025-04-25',26.5,'ясно',57,83,1016,'Пд',12),(53,'Німеччина','Гамбург','2025-04-25',22.3,'ясно',36,34,1011,'ПнСх',14),(54,'Німеччина','Кельн','2025-04-25',16.2,'сніг',88,56,1012,'ПдЗх',19),(55,'Німеччина','Берлін','2025-04-26',13.5,'ясно',2,66,1015,'Сх',10),(56,'Франція','Париж','2025-04-25',16.2,'хмарно',0,65,1013,'Зх',7),(57,'Франція','Ліон','2025-04-25',16.6,'хмарно',49,40,1011,'Пд',20),(58,'Франція','Париж','2025-04-26',15.8,'дощ',4,64,1013,'Зх',8),(59,'Італія','Рим','2025-04-25',20.1,'сонце',0,52,1016,'ПдСх',10),(60,'Італія','Мілан','2025-04-25',18.5,'ясно',5,65,1015,'Пд',12),(61,'Італія','Рим','2025-04-26',20.5,'сонце',0,53,1016,'Пд',11),(62,'Іспанія','Мадрид','2025-04-25',22.4,'сонце',0,45,1018,'Пд',6),(63,'Іспанія','Барселона','2025-04-25',21,'ясно',0,48,1017,'Сх',7),(64,'Іспанія','Мадрид','2025-04-26',23.1,'сонце',0,46,1018,'Пд',7),(65,'Україна','Київ','2025-04-25',15.5,'дощ',10,80,1012,'Пн',18),(66,'Україна','Київ','2025-04-25',15.5,'дощ',10,80,1012,'Пн',18),(67,'Україна','Львів','2025-04-25',19.5,'ясно',35,46,1012,'Сх',20),(68,'Україна','Одеса','2025-04-25',18.1,'дощ',33,43,1016,'Зх',11),(69,'Україна','Харків','2025-04-25',11.2,'ясно',35,74,1016,'ПдСх',9),(70,'Україна','Запоріжжя','2025-04-25',16.4,'ясно',22,55,1013,'Пд',12),(71,'Україна','Черкаси','2025-04-25',14.2,'дощ',5,67,1010,'Сх',15),(72,'Україна','Дніпро','2025-04-25',17,'сніг',1,80,1012,'ПдЗх',10),(73,'Україна','Кривий Ріг','2025-04-25',13.8,'хмарно',0,75,1014,'ПдЗх',8),(74,'Україна','Миколаїв','2025-04-25',19,'ясно',12,48,1015,'ПдЗх',14),(75,'Україна','Чернівці','2025-04-25',17.5,'дощ',8,70,1011,'ПдСх',11),(76,'Україна','Львів','2025-04-26',19.5,'ясно',35,46,1012,'Сх',20),(77,'Україна','Одеса','2025-04-26',18.1,'дощ',33,43,1016,'Зх',11),(78,'Україна','Харків','2025-04-26',11.2,'ясно',35,74,1016,'ПдСх',9),(79,'Україна','Запоріжжя','2025-04-26',16.4,'ясно',22,55,1013,'Пд',12),(80,'Україна','Черкаси','2025-04-26',14.2,'дощ',5,67,1010,'Сх',15),(81,'Україна','Кривий Ріг','2025-04-26',13.8,'хмарно',0,75,1014,'ПдЗх',8),(82,'Україна','Миколаїв','2025-04-26',19,'ясно',12,48,1015,'ПдЗх',14),(83,'Україна','Львів','2025-04-27',19.5,'ясно',35,46,1012,'Сх',20),(84,'Україна','Одеса','2025-04-27',18.1,'дощ',33,43,1016,'Зх',11),(85,'Польща','Варшава','2025-04-25',12.3,'хмарно',0,76,1011,'ПнСх',13),(86,'Польща','Краків','2025-04-25',24.4,'ясно',86,50,1010,'Сх',16),(87,'Польща','Гданськ','2025-04-25',22.2,'сніг',2,33,1017,'ПдСх',11),(88,'Польща','Вроцлав','2025-04-25',9.1,'дощ',73,59,1010,'Пн',9),(89,'Польща','Варшава','2025-04-26',12,'хмарно',3,75,1012,'Пн',14),(90,'Німеччина','Берлін','2025-04-25',14.7,'ясно',0,68,1015,'Сх',9),(91,'Німеччина','Мюнхен','2025-04-25',26.5,'ясно',57,83,1016,'Пд',12),(92,'Німеччина','Гамбург','2025-04-25',22.3,'ясно',36,34,1011,'ПнСх',14),(93,'Німеччина','Кельн','2025-04-25',16.2,'сніг',88,56,1012,'ПдЗх',19),(94,'Німеччина','Берлін','2025-04-26',13.5,'ясно',2,66,1015,'Сх',10),(95,'Франція','Париж','2025-04-25',16.2,'хмарно',0,65,1013,'Зх',7),(96,'Франція','Ліон','2025-04-25',16.6,'хмарно',49,40,1011,'Пд',20),(97,'Франція','Париж','2025-04-26',15.8,'дощ',4,64,1013,'Зх',8),(98,'Італія','Рим','2025-04-25',20.1,'сонце',0,52,1016,'ПдСх',10),(99,'Італія','Мілан','2025-04-25',18.5,'ясно',5,65,1015,'Пд',12),(100,'Італія','Рим','2025-04-26',20.5,'сонце',0,53,1016,'Пд',11),(101,'Іспанія','Мадрид','2025-04-25',22.4,'сонце',0,45,1018,'Пд',6),(102,'Іспанія','Барселона','2025-04-25',21,'ясно',0,48,1017,'Сх',7),(103,'Іспанія','Мадрид','2025-04-26',23.1,'сонце',0,46,1018,'Пд',7);
/*!40000 ALTER TABLE `weatherdata` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2025-06-05 19:51:48
